{
  "title": "Scratch-zu-Python-Konverter",
  "description": "So konvertieren Sie eine Scratch-Datei in Python",
  "loading": "Wird geladen...",
  "back_step1": "Gehen Sie zurück zu Schritt 1",
  "back": "zurück",
  "next": "nächste",
  "generate": "Generieren",
  "show_preview": "Vorschau zeigen",
  "close_preview": "Vorschau schließen",
  "download": "Herunterladen",
  "language": "Sprache",
  "english": "Englisch",
  "german": "Deutsch",
  "chinese": "Chinesisch",
  "step1hint": "Schritt 1: Bitte wählen Sie eine Möglichkeit aus, Ihr Scratch-Projekt in Python zu konvertieren.",
  "through_link": "Durch Link",
  "through_file": "Durch Datei",
  "step2hint": "Schritt 2: Bitte fügen Sie hier den Link zu Ihrem Scratch-Projekt ein.",
  "step2_file": "Schritt 2: Bitte laden Sie Ihre Scratch-Projektdatei hoch, die mit endet",
  "step2subhint1": "Wie folgt: (Teilen Sie zuerst Ihr Projekt)",
  "link_input_placeholder": "Fügen Sie hier den Link zu Ihrem Scratch-Projekt ein",
  "step2subhint2": "Die Schaltfläche „Weiter“ wird nicht angezeigt, wenn der Link ungültig erscheint",
  "step3hint": "Schritt 3: Wählen Sie die Sprache.",
  "step3subhint1": "Der Code in der Blackbox ist der eigentliche Befehl.",
  "step3subhint2": "Erfahren Sie mehr über Pystage!",
  "step4hint": "Schritt 4: Sehen Sie sich den generierten Code in der Vorschau an oder laden Sie ihn herunter.",
  "success_info": "Datei erfolgreich generiert!",
  "thanks_info": "Viel Spaß mit Ihrem konvertierten Scratch-Code!",
  "select_file": "Datei aussuchen",
  "tutorial" : "Klicken Sie auf ein Bild, um das Tutorial zu starten.",
  "error_in_generating": "Fehler beim Generieren der Datei!",
  "success_in_generating": "Datei erfolgreich generiert!",
  "beginner": "Anfänger",
  "mediocre": "mittelmäßig",
  "master": "Meister",
  "WebDevelopers": "Web-Entwickler",
  "beginnerTutorial": "Anfänger-Tutorial",
  "mediocreTutorial": "Mittelmäßiges Tutorial",
  "masterTutorial": "Master-Tutorial",
  "easyTutorialSentence1": "In diesem Tutorial lernen Sie, wie Sie jedes von Ihnen erstellte Scratch-Projekt in die Programmiersprache Python konvertieren.",
  "easyTutorialSentence2": "Dieses Bild unten zeigt Dot den Hund in seinem natürlichen Lebensraum, der ... SCRATCH!",
  "easyTutorialSentence3": "Klicken Sie auf den Code unten, wenn Sie erfahren möchten, wie Sie ihn selbst herstellen können!",
  "easyTutorialSentence4": "Scratch ist die weltweit größte kostenlose Programmier-Community für Kinder und ebnet den Weg für die Zukunft der Informatik.",
  "easyTutorialSentence5": "Wenn Sie zum ersten Mal Scratch verwenden, gehen Sie zu:",
  "easyTutorialSentence6": "Wenn Sie neu bei Scratch sind, klicken Sie auf „Scratch beitreten“, andernfalls klicken Sie auf „Anmelden“.",
  "easyTutorialSentence7": "Jetzt können Sie Ihr Konto erstellen und auf „Erstellen“ klicken, um Ihr Projekt zu erstellen!",
  "easyTutorialSentence8": "Sie können mit dem obigen Beispiel beginnen, wenn Sie nicht wissen, wo Sie anfangen sollen.",
  "easyTutorialSentence9": "Erfahren Sie, wie die Konvertierung funktioniert",
  "easyTutorialSentence10": "Dieses nächste Bild ist Teil dieses in Python konvertierten Projekts.",
  "easyTutorialSentence11": "Können Sie im Python-Code und im Scratch-Code erkennen, wann der Hund 10 Schritte macht?",
  "easyTutorialSentence12": "Hier ist ein einfaches Beispiel für den Konvertierungsprozess!",
  "easyTutorialSentence13": "Python-Code lernen",
  "easyTutorialSentence14": "„Selbst“ im folgenden Code bezieht sich auf das Sprite, das wir in unserem Programm verwendet haben. In diesem Fall ist unser Hund namens Dot unser Sprite.",
  "easyTutorialSentence15": "Self repräsentiert die Instanz einer Klasse und in diesem Fall unseren Hund namens Dot in seinem aktuellen Zustand.",
  "easyTutorialSentence16": "Dann wird „Selbst“ verwendet, um den Hund 10 Schritte zu bewegen und ihn zum Bellen zu bringen.",
  "easyTutorialSentence17": "definiert eine Funktion, die startet, wenn auf die grüne Flagge geklickt wird, damit der Code ausgeführt werden kann.",
  "easyTutorialSentence18": "Der folgende Code richtet die Bühne und das Sprite für Ihr Scratch-Projekt ein",
  "easyTutorialSentence19": "Deshalb umfasst unser Programm Töne, Bilder, Variablen, Kostüme und eine Bühne.",
  "easyTutorialSentence20": "Können Sie die Codezeile finden, in die Pystage die Bühne und das Sprite importiert?",
  "easyTutorialSentence21": "Wie lautet die Zahl für center_y in „dot_c“?",
  "easyTutorialSentence22": "Hinweis: Dot_c ist ein Kostüm für Dot, das seine Beine bewegt, wenn er sich bewegt.",
  "easyTutorialSentence23": "Dieses Programm läuft nicht ohne diese letzte Codezeile am Ende, die die Funktion when_program_starts_1 aufruft und die Phase startet.",
  "easyTutorialSentence24": "Ich glaube, du lernst!",
  "easyTutorialSentence25": "Um PyStage verwenden zu können, müssen Sie zunächst ein Scratch-Projekt erstellen",
  "easyTutorialSentence26": "und speichern Sie es auf Ihrem Computer oder kopieren Sie Ihren Projektlink.",
  "easyVideoSentence" : "Hier ist ein Link zu einem Video für Anfänger, die PyStage lernen!",
  "easyTutorialSentence27": "Fehler, die beim Generieren auftreten können",
  "easyTutorialSentence28": "Fehler beim Generieren der Datei!",
  "easyTutorialSentence29": "Das bedeutet, dass die Website den Inhalt für Ihr Projekt nicht laden konnte.",
  "easyTutorialSentence30": "Ungültige URL oder interner Fehler!",
  "easyTutorialSentence31": "Die URL ist falsch oder Scratch hat Serverprobleme, während Sie Ihr Projekt erstellen.",
  "easyTutorialSentence32": "Unbekannter Fehler",
  "easyTutorialSentence33": "Höchstwahrscheinlich gibt es etwas, das Sie in Ihrem Projekt noch nicht implementiert haben.",
  "easyTutorialSentence34": "Bedenken Sie, dass sich PyStage in der Entwicklungsphase befindet und möglicherweise noch nicht alles wie vorgesehen funktioniert.",
  "easyTutorialSentence35": "Wenn Ihr Projekt generiert wird, wird dieses Feld angezeigt und erklärt, was PyStage noch nicht implementiert hat.",
  "easyTutorialSentence36": "Bitte gehe zu",
  "easyTutorialSentence37": "wenn Sie Probleme mit PyStage melden möchten.",
  "easyTutorialSentence38": "Nachdem Ihr Projekt nun in Python konvertiert wurde, besteht der nächste Schritt darin, Ihr Projekt mit Visual Studio Code auszuführen!",
  "easyTutorialSentence39": "Wenn Sie Visual Studio Code nicht haben, können Sie es über diesen Link herunterladen",
  "easyTutorialSentence40": "Laden Sie Ihren Code auf unserer Website herunter.",
  "easyTutorialSentence41": "Nehmen Sie Ihre ZIP-Datei und entpacken Sie sie, indem Sie mit der rechten Maustaste auf die ZIP-Datei klicken und auf klicken",
  "extractHere": "hier entpacken.",
  "easyTutorialSentence42": "Denken Sie beim Speichern Ihres Projekts auf Ihrem Computer daran, in welchem ​​Ordner Sie Ihr Projekt abgelegt haben.",
  "easyTutorialSentence43": "Navigieren Sie zu Ihrem Ordner",
  "easyTutorialSentence44": "Gehen Sie zu Visual Studio Code, klicken Sie auf Datei und Ordner öffnen und öffnen Sie Ihren entpackten Ordner.",
  "easyTutorialSentence45": "Klicken Sie oben links auf Ihrem Bildschirm auf Terminal in Visual Studio Code.",
  "easyTutorialSentence46": "Navigieren Sie im Terminal mit dem Befehl cd zu Ihrem Ordner mit Ihrem entpackten Code",
  "easyTutorialSentence47": "Ihr Dateipfad unterscheidet sich möglicherweise von meinem. Hier ist ein Beispiel meines Dateipfads.",
  "easyTutorialSentence48": "Python herunterladen",
  "easyTutorialSentence49": "Wenn Sie Python noch nicht heruntergeladen haben, öffnen Sie Visual Studio Code und auf der linken Seite Ihres Bildschirms sollte eine Registerkarte mit dem Namen „Erweiterungen“ angezeigt werden.",
  "easyTutorialSentence50": "Klicken Sie auf „Erweiterungen“, geben Sie „Python“ ein und laden Sie herunter, was Sie im Bild unten sehen.",
  "easyTutorialSentence51": "Voraussetzungen für die Pip-Installation, bevor Sie beginnen",
  "easyTutorialSentence52": "Öffnen Sie das Terminal und pip install die folgenden Befehle.",
  "easyTutorialSentence53": "Führen Sie beispielsweise „pip installwheel“ aus und fahren Sie mit „pip install“ für alles fort, was in der Liste unten aufgeführt ist.",
  "easyTutorialSentence54": "Nachdem Sie Ihre Umgebung eingerichtet haben, können Sie schließlich Ihren Python-Code öffnen.",
  "easyTutorialSentence55": "Klicken Sie mit der rechten Maustaste in den Python-Dateieditor und wählen Sie „Python-Datei im Terminal ausführen“, um den Code auszuführen. Er sollte so aussehen.",
  "easyTutorialSentence56": "Sie können im Terminal auch „python pystagedog.py“ oder einen anderen Namen Ihrer Datei eingeben.",
  "easyTutorialSentence57": "Das ist es! Viel Spaß mit Ihrem konvertierten Code!",
  "mediumTutorialSentence1": "In diesem Tutorial erfahren Sie, wie Sie ein einfaches Rubbelspiel mit einem Ziel am Ende erstellen!",
  "mediumTutorialSentence2": "Im Bild oben fehlt eine Codezeile des Spiels. Können Sie erraten, was das ist?",
  "mediumTutorialSentence3": "Die Antwort verraten wir Ihnen am Ende dieses Tutorials.",
  "mediumTutorialSentence4": "Lassen Sie uns zunächst jeden einzelnen Codeblock durchgehen und sehen, was er bewirkt.",
  "mediumTutorialSentence5": "Dieser Codeblock wird ausgeführt, wenn auf die grüne Flagge geklickt wird, zeigt eine Meldung an und setzt den Timer und die Punktzahl zurück.",
  "mediumTutorialSentence6": "Klicken Sie auf Ereignisse und ziehen Sie, wenn die grüne Flagge angeklickt wird, in den Skriptbereich.",
  "mediumTutorialSentence7": "Klicken Sie auf „Looks“, ziehen Sie den Denkblock in den Skriptbereich und schreiben Sie eine Nachricht.",
  "mediumTutorialSentence8": "Klicken Sie auf „Sensing“ und ziehen Sie „Timer zurücksetzen“ in den Skriptbereich.",
  "mediumTutorialSentence9": "Klicken Sie auf Variablen und ziehen Sie set your_score auf 0 in den Skriptbereich.",
  "mediumTutorialSentence10": "Jetzt fordere ich Sie heraus, die restlichen Blöcke selbst zu finden!",
  "mediumTutorialSentence11": "Dieser Codeblock wird ausgeführt, wenn die d-Taste gedrückt wird, wenn Sie sich im Spiel nach rechts bewegen.",
  "mediumTutorialSentence12": "Wenn Sie die Cheesy Puffs berühren, erscheint die Meldung Yum!",
  "mediumTutorialSentence13": "Dein Punktestand ändert sich dann um 1, solange du die Cheesy Puffs berührst",
  "mediumTutorialSentence14": "Sehen Sie, wie viele Punkte Sie sammeln können, bevor es verschwindet!",
  "mediumTutorialSentence15": "Dieser Code ändert x um 10 oder -10, je nachdem, ob a oder d auf Ihrer Tastatur gedrückt wird.",
  "mediumTutorialSentence16": "Der Katze wird ein neues Kostüm ausgestellt, damit die Katze so aussieht, als würde sie laufen.",
  "mediumTutorialSentence17": "Dieser Code wird verwendet, wenn die Cheesy Puffs Sprite1 berühren. (die Katze)",
  "mediumTutorialSentence18": "Wenn die grüne Flagge angeklickt wird",
  "mediumTutorialSentence19": "Die Cheesy Puffs gehen in unserem Spiel auf die Koordinaten x: 150 und y: -130.",
  "mediumTutorialSentence20": "Die Größe der Cheesy Puffs ist auf 100 % eingestellt, um alle Größenänderungen aus früheren Spielen zurückzusetzen.",
  "mediumTutorialSentence21": "Wenn die d-Taste gedrückt wird ",
  "mediumTutorialSentence22": "Wenn die Cheesy Puffs die Katze berühren, warten wir 1 Sekunde.",
  "mediumTutorialSentence23": "Versuchen Sie in dieser einen Sekunde, so viele Punkte wie möglich zu sammeln!",
  "mediumTutorialSentence24": "Dann wird die Größe auf 0 % gesetzt, was jedoch nicht dazu führt, dass die Cheesy Puffs vollständig vom Bildschirm verschwinden.",
  "mediumTutorialSentence25": "Wir haben die x- und y-Koordinaten auf -1000 gesetzt, damit Sie die Cheesy Puffs nicht auf dem Bildschirm sehen können.",
  "mediumTutorialSentence26": "Wenn Sie die grüne Flagge drücken, werden die X- und Y-Koordinaten auf ihre ursprüngliche Position zurückgesetzt.",
  "mediumTutorialSentence27": "Dies ist unser in Python konvertiertes Projekt.",
  "mediumTutorialSentence28": "Können Sie die Python-Funktion finden, die mit den Scratch-Blöcken übereinstimmt? Versuchen Sie, auf den Code oben zu klicken, um ihn zu erraten.",
  "hardTutorialSentence1": "In diesem Tutorial erfahren Sie, wie Sie Klone und Nachrichten in einem Scratch-Spiel verwenden.",
  "hardTutorialSentence2": "Regeln:",
  "hardTutorialSentence3": "Iss mehr als 100 Donuts in 30 Sekunden, um zu gewinnen!",
  "hardTutorialSentence4": "Lass Squirrel2 nicht 100 Donuts essen!",
  "hardTutorialSentence5": "Drücken Sie w, um nach oben zu gehen, und s, um nach unten zu gehen.",
  "hardTutorialSentence6": "a, um sich nach links zu bewegen, und d, um sich nach rechts zu bewegen.",
  "hardTutorialSentence7": "Geben Sie ein, wie viele Exemplare der Donuts Sie möchten.",
  "hardTutorialSentence8": "Diese Donuts erscheinen, wenn Sie das Spiel starten.",
  "hardTutorialSentence9": "Können Sie sich vorstellen, wie Sie dieses Spiel verbessern könnten, um es für einen Benutzer, der das Spiel spielt, besser zu machen?",
  "hardTutorialSentence10": "Die drei Sprites in diesem Projekt sind das Eichhörnchen, die Donuts und das Eichhörnchen2.",
  "hardTutorialSentence11": "Wir werden jedes Sprite einzeln durchgehen.",
  "hardTutorialSentence12": "Hier ist der Code für das Eichhörnchen-Sprite.",
  "hardTutorialSentence13": "Dieser Codeblock sorgt dafür, dass das Eichhörnchen gewinnt, nachdem es über 100 Donuts gegessen hat.",
  "hardTutorialSentence14Bold": "Wenn eine beliebige Taste gedrückt wird",
  "hardTutorialSentence14": "Wenn Donuts größer als 100 ist, wiederholen wir die folgende Endlosschleife.",
  "hardTutorialSentence15": "Wir stellen die Größe auf 1000 % ein, der Hintergrund wechselt zu Sternen und alle anderen Befehle werden gestoppt.",
  "hardTutorialSentence16": "Dieser Code lässt das Eichhörnchen nach 30 Sekunden Spielzeit verlieren.",
  "hardTutorialSentence17": "Wenn Donuts weniger als 100 sind, warten wir, bis der Timer mehr als 30 Sekunden beträgt.",
  "hardTutorialSentence18": "Anschließend schalten wir den Hintergrund auf Sterne um und stoppen alle anderen Befehle.",
  "hardTutorialSentence19": "Wenn das Eichhörnchen einen Donut berührt, ändern wir den Donuts-Score um 1",
  "hardTutorialSentence20": "Wenn der Donuts-Score größer als 20 ist, verkleinern Sie das Eichhörnchen auf 30 % seiner Größe und sagen Sie eine Nachricht.",
  "hardTutorialSentence21": "Wenn die grüne Flagge angeklickt wird",
  "hardTutorialSentence22": "Setzen Sie den Donuts-Score auf 0 zurück und setzen Sie die Größe des Eichhörnchens und des Hintergrunds zurück.",
  "hardTutorialSentence23": "Wir sagen 5 Sekunden lang eine Nachricht und sagen dann eine weitere Nachricht, die die Steuerung des Spiels erklärt.",
  "hardTutorialSentence24": "Die Meldung zur Erläuterung der Steuerelemente stoppt, wenn die Punktzahl über 20 liegt, da wir dann unsere Hard-Mode-Meldung im ersten Codebild oben sagen.",
  "hardTutorialSentence25": "Finden Sie diese Nachricht: Hard Mode! Ich brauche 100 Donuts!",
  "hardTutorialSentence26": "Wenn der Hintergrund zu Sternen wechselt",
  "hardTutorialSentence27": "Wenn der Donuts-Score weniger als 100 beträgt, dann sagen Sie",
  "hardTutorialSentence28": "Du verlierst, ich habe Hunger!",
  "hardTutorialSentence29": "Andernfalls sagen Sie, wenn Donuts größer als 100 ist",
  "hardTutorialSentence30": "Lecker! Ich bin fertig!",
  "hardTutorialSentence31": "Wenn Donuts gleich 100 sind, bedeutet dies in unserem Code, dass Sie das Spiel trotzdem verlieren und keine Meldung angezeigt wird.",
  "hardTutorialSentence32": "Welche Botschaft würden Sie in den Code einfügen, wenn die Zahl der Eichhörnchen-Donuts 100 beträgt?",
  "hardTutorialSentence33": "Dieser Code führt die Steuerelemente für das Eichhörnchen aus.",
  "hardTutorialSentence34": "Wenn Sie w drücken, gehen Sie nach oben, und wenn Sie s drücken, gehen Sie nach unten.",
  "hardTutorialSentence35": "Wenn Sie a drücken, gehen Sie nach links, und wenn Sie d drücken, gehen Sie nach rechts.",
  "hardTutorialSentence36": "Dieser Code ist für das Donut-Sprite in unserem Spiel.",
  "hardTutorialSentence38": "Im Bühnen-Sprite erstellen wir einen Codeblock, der gesendet wird!",
  "hardTutorialSentence39": "Wenn ich erhalte, los!",
  "hardTutorialSentence41": "Wir erhalten die Nachricht los! wenn im Typfeld auf die blaue Flagge geklickt wird.",
  "hardTutorialSentence42": "In diesem Feld werden Sie gefragt, wie viele Donut-Kopien Sie erzeugen möchten, wenn Sie das Spiel spielen.",
  "hardTutorialSentence43": "Sobald Sie das Häkchen im Textfeld drücken, wird das Textfeld ausgeblendet und die Donuts erscheinen.",
  "hardTutorialSentence44": "Wir wiederholen die Anzahl der im Typfeld eingegebenen Klone und lassen sie an eine zufällige Position verschieben.",
  "hardTutorialSentence45": "Dann setzen wir x2 auf eine x-Position und y2 auf eine beliebige y-Position und erstellen einen Klon von mir.",
  "hardTutorialSentence46": "Wenn ich als Klon anfange",
  "hardTutorialSentence47": "Der Donut geht zu x: x2 und y: y2.",
  "hardTutorialSentence48": "Dadurch erscheinen die Donuts an zufälligen Orten.",
  "hardTutorialSentence49": "Wir stellen den Rotationsstil so ein, dass die Donuts nicht rotieren und angezeigt werden.",
  "hardTutorialSentence50": "Wir durchlaufen eine Dauerschleife der Brownschen Bewegung. Die Brownsche Bewegung ist ein Block in Scratch.",
  "hardTutorialSentence51": "Ein Block in Scratch verhält sich wie eine eingebaute Funktion, die jederzeit aufgerufen werden kann.",
  "hardTutorialSentence52": "Dann lassen wir die Donuts 5 Sekunden lang in eine zufällige Position gleiten.",
  "hardTutorialSentence53": "Um diesen Block in Scratch zu erstellen, befolgen Sie diese Schritte:",
  "hardTutorialSentence54": "1. Klicken Sie auf Meine Blöcke",
  "hardTutorialSentence55": "2. Machen Sie einen Block",
  "hardTutorialSentence56": "3. Benennen Sie Ihren Block und drücken Sie OK.",
  "hardTutorialSentence57": "Brownsche Bewegung",
  "hardTutorialSentence58": "dreht eine Zufallszahl von 0 auf 359 Grad und verschiebt verschiedene Schritte.",
  "hardTutorialSentence59": "Variation ist eine Variable wie x2, y2 und Anzahl Klone, die die Bewegung jedes einzelnen Donuts ändert.",
  "hardTutorialSentence60": "So erstellen Sie eine Variable: Klicken Sie in Scratch auf „Variablen“, dann auf „Variable erstellen“ und benennen Sie diese Variablenvariation",
  "hardTutorialSentence61": "Im Bühnen-Sprite setzen wir dann die Variation auf 5 und die Anzahl der zu beantwortenden Klone.",
  "hardTutorialSentence62": "Dieser Code wird für das böse Eichhörnchen verwendet, das in unserem Code Squirrel2 ist.",
  "hardTutorialSentence63": "Wenn eine beliebige Taste gedrückt wird",
  "hardTutorialSentence64": "Wenn Eichhörnchen2 Donut berührt, ändert sich die Variable Squirrel2 Donuts um 1.",
  "hardTutorialSentence65": "Wenn die grüne Flagge geklickt hat",
  "hardTutorialSentence66": "Schleife eine Nachricht für immer und gleite 5 Sekunden lang an eine zufällige Position.",
  "hardTutorialSentence67": "Wenn die grüne Flagge geklickt hat",
  "hardTutorialSentence68": "Squirrel2 Donuts auf 0 zurücksetzen.",
  "hardTutorialSentence69": "Wenn eine beliebige Taste gedrückt wird",
  "hardTutorialSentence70": "Wenn Eichhörnchen-Donuts größer als 100 sind, setzen Sie Squirrel2-Donuts auf 0.",
  "hardTutorialSentence71": "Wenn eine beliebige Taste gedrückt wird",
  "hardTutorialSentence72": "Wenn Squirrel2 Donuts größer als 99 ist, wird eine Endlosschleife ausgeführt.",
  "hardTutorialSentence73": "Wir setzen die Größe von Squirrel2 auf 100 %, stellen den Hintergrund auf Sterne um und stoppen alle anderen Befehle.",
  "hardTutorialSentence74": "Wenn der Hintergrund zu Sternen wechselt",
  "hardTutorialSentence75": "Wenn Squirrel2 Donuts größer als 99 ist, sagen Sie eine Nachricht.",
  "hardTutorialSentence76": "Sehen wir uns nun an, ob Sie den Scratch-Code mit dem Python-Code in Einklang bringen können!",
  "hardTutorialSentence77": "Mit welchem ​​Scratch-Codeblock stimmt diese Pyhton-Codezeile überein?",
  "green" : "Klicken Sie zur Auswahl auf den Scratch-Code.",
  "hardTutorialSentence78": "Sie können auch auf Ihr Sprite zurückgreifen, um Ihren Charakter so zu gestalten, wie Sie es möchten.",
  "hardTutorialSentence79": "Klicken Sie im Scratch-Editor auf „Kostüme“ und dann auf „Ausfüllen“, um Ihre Farbe auszuwählen!",
  "hardTutorialSentence80": "Sie können zeichnen, eine Linie, einen Kreis oder ein Quadrat erstellen, Text hinzufügen, einen Bereich mit Farbe füllen, löschen und Ihr Sprite auswählen.",
  "hardTutorialSentence81": "Jetzt sieht Ihr Sprite so aus, wie Sie es im Spiel gezeichnet haben.",
  "TutorialSentence1": "So erstellen Sie ein einfaches Scratch-Projekt.",
  "TutorialSentence2": "1. Datei -> Neu.",
  "TutorialSentence3": "2. Klicken Sie unten rechts auf „Sprite auswählen“.",
  "TutorialSentence4": "3. Suchen Sie in der Suchleiste nach „dot“ und klicken Sie auf „dot the dog“.",
  "TutorialSentence5": "4. Als nächstes löschen Sie die Katze, indem Sie auf den Mülleimer auf dem Sprite klicken",
  "TutorialSentence6": "5. Klicken Sie auf Ereignisse.",
  "TutorialSentence7": "6. Ziehen Sie „Wenn die grüne Flagge angeklickt wird“ in den Skriptbereich.",
  "TutorialSentence8": "7. Klicken Sie auf Bewegung.",
  "TutorialSentence9": "8. Ziehen Sie 10 Schritte in den Skriptbereich.",
  "TutorialSentence10": "9. Klicken Sie auf Töne.",
  "TutorialSentence11": "10. Ziehen Sie Start Sound Bark in den Skriptbereich.",
  "TutorialSentence12": "11. Stellen Sie sicher, dass alle 3 Schritte in genau dieser Reihenfolge miteinander verbunden sind",
  "TutorialSentence13": "12. Drücken Sie die grüne Flagge, um Ihr Projekt auszuführen."


}
