{
  "title": "Scratch To Python Converter",
  "description": "How to convert a Scratch file to python",
  "loading": "Loading...",
  "back_step1": "Go Back To Step 1",
  "back": "Back",
  "next": "Next",
  "generate": "Generate",
  "show_preview": "Show Preview",
  "close_preview": "Close Preview",
  "download": "Download",
  "language": "language",
  "english": "English",
  "german": "German",
  "chinese": "Chinese",
  "step1hint": "Step 1: Please select a way to convert your scratch project to python",
  "through_link": "Through Link",
  "through_file": "Through File",
  "step2hint": "Step 2: Please paste your scratch project link here.",
  "step2_file": "Step 2: Please upload your scratch project file that ends with",
  "step2subhint1": "Like following: (Share your project first)",
  "link_input_placeholder": "Paste your scratch project link here",
  "step2subhint2": "Next button won't show up if link looks not valid",
  "step3hint": "Step 3: Choose the language.",
  "step3subhint1": "The code in black box is the actual command.",
  "step3subhint2": "Learn more about pystage!",
  "step4hint": "Step 4: Preview the generated code or download it.",
  "success_info": "File generated successfully!",
  "thanks_info": "Enjoy your converted Scratch code!",
  "select_file": "Select file",
  "tutorial" : "Click on an image to start the tutorial.",
  "error_in_generating": "Error in generating file!",
  "success_in_generating": "File generated successfully!",
  "beginner": "Beginner",
  "mediocre": "Mediocre",
  "master": "Master",
  "WebDevelopers": "Web Developers",
  "beginnerTutorial": "Beginner Tutorial",
  "mediocreTutorial": "Mediocre Tutorial",
  "masterTutorial": "Master Tutorial",
  "easyTutorialSentence1": "This tutorial will help you learn how to convert any scratch project you make into the Python programming language.",
  "easyTutorialSentence2": "This image below shows Dot the dog in his natural habitat which is...SCRATCH!",
  "easyTutorialSentence3": "Click on the code below if you want to learn how to make it yourself!",
  "easyTutorialSentence4": "Scratch is the world's largest free coding community for kids and is paving the way for the future of computer science.",
  "easyTutorialSentence5": "If it is your first time with scratch go to: ",
  "easyTutorialSentence6": "If you are new to scratch click Join Scratch else click Sign in.",
  "easyTutorialSentence7": "Now you can make your account and click create to create your project!",
  "easyTutorialSentence8": "You can start with the example above if you do not know where to start.",
  "easyTutorialSentence9": "Learning about how the conversion works",
  "easyTutorialSentence10": "This next image is part of this project converted into python.",
  "easyTutorialSentence11": "Can you find when the dog moves 10 steps in the python code and the scratch code?",
  "easyTutorialSentence12": "Here is an easy example of the conversion process!",
  "easyTutorialSentence13": "Learning Python code",
  "easyTutorialSentence14": "Self in the code below refers to the sprite we used in our program in this case our dog named Dot is our sprite.",
  "easyTutorialSentence15": "Self represents the instance of a class and in this case it represents our Dog named Dot at its current state.",
  "easyTutorialSentence16": "Self is then used to move the dog 10 steps and make him bark.",
  "easyTutorialSentence17": "defines a function that starts when the green flag is clicked so the code can run.",
  "easyTutorialSentence18": "The code below sets up the stage and sprite for your Scratch project",
  "easyTutorialSentence19": "This makes our program include sounds, images, variables, costumes and a stage.",
  "easyTutorialSentence20": "Can you find the line of code where pystage imports the stage and sprite?",
  "easyTutorialSentence21": "What is the number for center_y in 'dot_c'?",
  "easyTutorialSentence22": "Hint: Dot_c is a costume for dot that moves his legs when he moves.",
  "easyTutorialSentence23": "This program does not run without this last line of code at the end that calls the function when_program_starts_1 and starts the stage.",
  "easyTutorialSentence24": "I think you are learning!",
  "easyTutorialSentence25": "To use PyStage you first need to make a scratch project",
  "easyTutorialSentence26": "and save it to your computer or copy your project link.",
  "easyVideoSentence" : "Here is a link to a video for beginners learning PyStage!",
  "easyTutorialSentence27": "Errors that can happen when generating",
  "easyTutorialSentence28": "Error in generating file!",
  "easyTutorialSentence29": "This means that the website could not load the content for your project.",
  "easyTutorialSentence30": "Invalid URL or internal error!",
  "easyTutorialSentence31": "URL is incorrect or scratch is having server issues while you are generating your project.",
  "easyTutorialSentence32": "Unknown Error",
  "easyTutorialSentence33": "Most likely there is something not implemented yet that you used in your project.",
  "easyTutorialSentence34": "Keep in mind PyStage is in working development and not everything may work as intended yet.",
  "easyTutorialSentence35": "When your project is generated this box will show up explaining what PyStage has not implemented yet.",
  "easyTutorialSentence36": "Please go to",
  "easyTutorialSentence37": "if you have any issues to report with PyStage.",
  "easyTutorialSentence38": "Now that your project is converted into python the next step is to run your project with Visual Studio Code!",
  "easyTutorialSentence39": "If you do not have Visual Studio Code you can download it with this link ",
  "easyTutorialSentence40": "Download your code on our website.",
  "easyTutorialSentence41": "Take your zip file and unzip it by right-clicking the zip file and clicking",
  "extractHere": "extract here.",
  "easyTutorialSentence42": "Remember when you save your project on your computer what folder you put your project in.",
  "easyTutorialSentence43": "Navagate to your folder",
  "easyTutorialSentence44": "Go to Visual Studio Code and click file and Open Folder and open your unzipped folder.",
  "easyTutorialSentence45": "In the top left of your screen click terminal in Visual Studio Code.",
  "easyTutorialSentence46": "In the terminal navigate to your folder with your unzipped code by using the command cd",
  "easyTutorialSentence47": "Your file path may be different to mine, here is an example of my filepath.",
  "easyTutorialSentence48": "Downloading Python",
  "easyTutorialSentence49": "If you have not downloaded python before open Visual Studio Code and on the left side of your screen you should see a tab that is called extensions.",
  "easyTutorialSentence50": "Click extensions and then type Python and download what you see in the picture below.",
  "easyTutorialSentence51": "Requirements to pip install before you begin",
  "easyTutorialSentence52": "Open the terminal and pip install the following commands.",
  "easyTutorialSentence53": "For example run pip install wheel and continue to run pip install for everything on the list below.",
  "easyTutorialSentence54": "Finally after setting up your enviroment you can open your python code.",
  "easyTutorialSentence55": "Right-click inside the Python file editor and select Run Python File in Terminal to run the code and it should look like this.",
  "easyTutorialSentence56": "You could also in the terminal type python pystagedog.py or whatever else you named your file.",
  "easyTutorialSentence57": "That is it! Enjoy your converted code!",
  "mediumTutorialSentence1": "This tutorial will take you through how to make a simple scratch game with a goal at the end!",
  "mediumTutorialSentence2": "There is one line of code missing in the image above from the game, can you guess what it is?",
  "mediumTutorialSentence3": "We will tell you the answer at the end of this tutorial.",
  "mediumTutorialSentence4": "For now lets go over each individual block of code and see what it does.",
  "mediumTutorialSentence5": "This block of code is executed when the green flag is clicked and it shows a message and resets the timer and score.",
  "mediumTutorialSentence6": "Click on events and drag when green flag is clicked to the script area.",
  "mediumTutorialSentence7": "Click on looks and drag the think block to the script area and write a message.",
  "mediumTutorialSentence8": "Click on sensing and drag reset timer to the script area.",
  "mediumTutorialSentence9": "Click on variables and drag set your_score to 0 to the script area.",
  "mediumTutorialSentence10": "Now I challenge you to find the rest of the blocks on your own!",
  "mediumTutorialSentence11": "This block of code is executed when the d key is pressed when you move right in the game.",
  "mediumTutorialSentence12": "If you are touching the Cheesy Puffs then a message pops up saying Yum!",
  "mediumTutorialSentence13": "You score then changes by 1 as long as you are touching the Cheesy Puffs",
  "mediumTutorialSentence14": "See how many points you can get before it disappears!",
  "mediumTutorialSentence15": "This code changes x by 10 or -10 based on if a or d is pressed on your keyboard.",
  "mediumTutorialSentence16": "A new costume is displayed for the cat to make the cat look like it is walking.",
  "mediumTutorialSentence17": "This code is used when the Cheesy Puffs touches Sprite1. (the cat)",
  "mediumTutorialSentence18": "When green flag is clicked",
  "mediumTutorialSentence19": "the Cheesy Puffs goes to the cordinates x: 150 and y: -130 in our game.",
  "mediumTutorialSentence20": "The size of the Cheesy Puffs is set to 100% to reset any size changes from past games.",
  "mediumTutorialSentence21": "When d key is pressed ",
  "mediumTutorialSentence22": "if the Cheesy Puffs are touching the cat then we wait 1 second.",
  "mediumTutorialSentence23": "In this one second try and get as many points as you can!",
  "mediumTutorialSentence24": "Then the size is set to 0% although this does not make the Cheesy Puffs completely dissapear off the screen.",
  "mediumTutorialSentence25": "We set the x and y cordinates to -1000 so you can not see the Cheesy Puffs on the screen.",
  "mediumTutorialSentence26": "When you press the green flag the x and y cordinates are reset to their original position.",
  "mediumTutorialSentence27": "This is our project converted into Python.",
  "mediumTutorialSentence28": "Can you find the Python function the matches with the Scratch blocks? Try and click on the code above to guess.",
  "hardTutorialSentence1": "This tutorial will teach you how to use clones and messages in a Scratch game.",
  "hardTutorialSentence2": "Rules:",
  "hardTutorialSentence3": "Eat more than 100 donuts in 30 seconds to win! ",
  "hardTutorialSentence4": "Do not let Squirrel2 eats 100 donuts!",
  "hardTutorialSentence5": "Press w to move up, s to move down.",
  "hardTutorialSentence6": "a to move left and d to move right.",
  "hardTutorialSentence7": "Type how many copies of donuts you want.",
  "hardTutorialSentence8": "These donuts will spawn when you start the game.",
  "hardTutorialSentence9": "Can you think of a way you would improve this game to make it better for a user playing the game?",
  "hardTutorialSentence10": "The three sprites in this project are the squirrel, donuts and squirrel2.",
  "hardTutorialSentence11": "We will go through each sprite one by one.",
  "hardTutorialSentence12": "Here is the code for the squirrel sprite.",
  "hardTutorialSentence13": "This code block makes the squirrel win after he eats over 100 donuts.",
  "hardTutorialSentence14Bold": "When any key is pressed",
  "hardTutorialSentence14": "if donuts is greater then 100 we loop the following forever.",
  "hardTutorialSentence15": "We set the size to 1000%, the backdrop switches to stars and all other commands are stopped.",
  "hardTutorialSentence16": "This code makes the squirrel lose after 30 seconds of play time.",
  "hardTutorialSentence17": "if donuts is less then 100 then we wait until the timer is greater then 30 seconds.",
  "hardTutorialSentence18": "We then switch backdrop to stars and stop all other commands.",
  "hardTutorialSentence19": "if the squirrel is touching a Donut then we change the Donuts score by 1",
  "hardTutorialSentence20": "If the Donuts score is greater then 20 then shrink the squirrel to 30% the size and say a message.",
  "hardTutorialSentence21": "When green flag is clicked",
  "hardTutorialSentence22": "reset Donuts score to 0, reset the size of the squirrel and the backdrop.",
  "hardTutorialSentence23": "We say a message for 5 seconds and then say another message explaining the controls of the game.",
  "hardTutorialSentence24": "The message explaining the controls stops when the score is over 20 because we then say our hard mode message in the first code image above.",
  "hardTutorialSentence25": "Find this message: Hard Mode! I need 100 donuts!",
  "hardTutorialSentence26": "When backdrop switches to stars ",
  "hardTutorialSentence27": "if the Donuts score is less then 100 then say",
  "hardTutorialSentence28": "You Lose, I'm Hungry!",
  "hardTutorialSentence29": "Else if Donuts is greater then 100 then say",
  "hardTutorialSentence30": "Yum! I am Done!",
  "hardTutorialSentence31": "If Donuts equals 100 then in our code this mean you still lose the game and no message is displayed.",
  "hardTutorialSentence32": "What message would you put in the code if the squirrels Donuts equals 100?",
  "hardTutorialSentence33": "This code executes the controls for the squirrel.",
  "hardTutorialSentence34": "If you press w you go up and if you press s you go down.",
  "hardTutorialSentence35": "If you press a you go left and if you press d you go right.",
  "hardTutorialSentence36": "This code is for the donut sprite in our game.",
  "hardTutorialSentence38": "In the stage sprite we make a block of code that broadcasts go!",
  "hardTutorialSentence39": "When I receive go!",
  "hardTutorialSentence41": "Is called when the blue flag is clicked in the type box in game.",
  "hardTutorialSentence42": "This box asks you how many copies of donuts you want to spawn when you play the game.",
  "hardTutorialSentence43": "Once you press the check mark on the type box we hide the text box and spawn the donuts.",
  "hardTutorialSentence44": "We repeat the number of clones typed in the type box and make them go to a random position.",
  "hardTutorialSentence45": "We then set x2 to an x position and set y2 to an y position and create clone of myself.",
  "hardTutorialSentence46": "When I start as a clone",
  "hardTutorialSentence47": "the donut goes to x: x2 and y: y2.",
  "hardTutorialSentence48": "This makes the donuts spawn in random locations.",
  "hardTutorialSentence49": "We set rotation style to don't rotate and show the donuts.",
  "hardTutorialSentence50": "We loop forever brownian motion. Brownian motion is a block in Scratch.",
  "hardTutorialSentence51": "A block in scratch acts like a built in function that can be called at any time.",
  "hardTutorialSentence52": "Then we glide the donuts for 5 seconds to a random position.",
  "hardTutorialSentence53": "To make this block in Scratch follow these steps:",
  "hardTutorialSentence54": "1. Click My blocks",
  "hardTutorialSentence55": "2. Make a block",
  "hardTutorialSentence56": "3. Name your block and press ok.",
  "hardTutorialSentence57": "Brownian motion",
  "hardTutorialSentence58": "turns a random number from 0 to 359 degrees and moves variation of steps.",
  "hardTutorialSentence59": "Variation is a variable like x2, y2 and num clones that changes the motion of each individual donuts.",
  "hardTutorialSentence60": "To make a variable Click Variables in Scratch and click Make a variable and name this variable variation ",
  "hardTutorialSentence61": "In the stage sprite we then set variation to 5 and num clones to answer.",
  "hardTutorialSentence62": "This code is used for the evil squirrel, which is Squirrel2 in our code.",
  "hardTutorialSentence63": "When any key is pressed",
  "hardTutorialSentence64": "if squirrel2 is touching Donut then the variable Squirrel2 donuts change by 1.",
  "hardTutorialSentence65": "When green flag clicked",
  "hardTutorialSentence66": "loop forever a message and glide for 5 seconds to a random position.",
  "hardTutorialSentence67": "When green flag clicked",
  "hardTutorialSentence68": "reset Squirrel2 donuts to 0.",
  "hardTutorialSentence69": "When any key pressed ",
  "hardTutorialSentence70": "if squirrel's donuts is greater then 100 then set Squirrel2 donuts to 0.",
  "hardTutorialSentence71": "When any key is pressed",
  "hardTutorialSentence72": "if Squirrel2 donuts is greater then 99 then loop forever.",
  "hardTutorialSentence73": "We set Squirrel2's size to 100% and switch backdrop to stars and stop all other commands.",
  "hardTutorialSentence74": "When backdrop switches to stars",
  "hardTutorialSentence75": "if Squirrel2 donuts is greater then 99 then say a message.",
  "hardTutorialSentence76": "Now lets see if you can match up the Scratch code with the Python code!",
  "hardTutorialSentence77": "Which block of Scratch code does this line of Pyhton code match up with?",
  "green" : "Click the Scratch code to choose.",
  "hardTutorialSentence78": "You can also draw on your sprite to make your character anything you want it to be.",
  "hardTutorialSentence79": "Click costumes in the scratch editor and click fill to choose your color!",
  "hardTutorialSentence80": "You can draw, create a line, circle, square, add text, fill an area with color, erase and select your sprite.",
  "hardTutorialSentence81": "Now your sprite will look like what you have drawn in game.",
  "TutorialSentence1": "How to make a basic scratch project.",
  "TutorialSentence2": "1. File -> New.",
  "TutorialSentence3": "2. Click choose a sprite in the bottom right corner.",
  "TutorialSentence4": "3. search for dot in the search bar and click on dot the dog.",
  "TutorialSentence5": "4. Next delete the cat by clicking on the trash can on the sprite.",
  "TutorialSentence6": "5. Click on Events.",
  "TutorialSentence7": "6. Drag When green flag clicked over to the script area.",
  "TutorialSentence8": "7. Click on Motion.",
  "TutorialSentence9": "8. Drag move 10 steps over to the script area.",
  "TutorialSentence10": "9. Click on Sounds.",
  "TutorialSentence11": "10. Drag start sound bark over to the script area.",
  "TutorialSentence12": "11. Make sure all 3 steps are connected to each other in this exact order",
  "TutorialSentence13": "12. Press the green flag to run your project."


}
